project/app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `users` where `email_verified` = 1
select count(*) as aggregate from `merchants` where `email_verified` = 1
select count(*) as aggregate from `currencies`
select count(*) as aggregate from `countries`
select count(*) as aggregate from `roles`
select count(*) as aggregate from `admins` where `role` != 'super-admin'
select * from `currencies` where `currencies`.`id` in (1, 6)
select * from `transactions` where `charge` > 0
select * from `users` order by `created_at` desc limit 7
select * from `merchants` order by `created_at` desc limit 7
select * from `deposits`
select * from `withdrawals`
---
    public function index()
    {
        $data['totalUser']     = User::where('email_verified',1)->count();
        $data['totalMerchant'] = Merchant::where('email_verified',1)->count();
        $data['totalCurrency'] = Currency::count();
        $data['totalCountry']  = Country::count();
        $data['totalRole']     = DB::table('roles')->count();
        $data['totalStaff']    = Admin::where('role','!=','super-admin')->count();

        $profit = collect([]);
        Transaction::where('charge','>',0)->with('currency')->get()->map(function($q) use($profit){
            $profit->push((float) amountConv($q->charge,$q->currency));
        });
        $data['totalProfit'] = round($profit->sum(),3);

        $data['recentUsers']     = User::latest()->take(7)->get();
        $data['recentMerchants'] = Merchant::latest()->take(7)->get();

        $deposit = collect([]);
        Deposit::with('currency')->get()->map(function($q) use($deposit){
            $deposit->push((float) amountConv($q->amount,$q->currency));
        });
        $data['totalDeposit'] = round($deposit->sum(),2);

        $withdraw = collect([]);
        Withdrawals::with('currency')->get()->map(function($q) use($withdraw){
            $withdraw->push((float) amountConv($q->amount,$q->currency));
        });